(* Copyright 2011 Cornell University
 * Copyright 2012 Cornell University
 *
 *
 * This file is part of EventML - a tool aiming at specifying
 * distributed protocols in an ML like language.  It is an interface
 * to the logic of events and is compiled into Nuprl.  It is written
 * by the NUPRL group of Cornell University, Ithaca, NY.
 *
 * EventML is a free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * EventML is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with EventML.  If not, see <http://www.gnu.org/licenses/>.
 *
 *  o Authors:     Vincent Rahli
 *  o Affiliation: Cornell University, NUPRL group
 *  o Date:        20 May 2011
 *  o File name:   Interface.sml
 *  o Description: EventML interface.
 *)


structure Interface :> INTERFACE = struct

structure P  = Parser
structure C  = ConfigParse
structure A  = Ast
structure E  = Enum
structure N  = ToNuprl
structure D  = Deps
structure G  = Gen
structure EN = Env
structure GL = GenLib
structure NT = NuprlTerms
structure EH = LibBase
structure EV = Evaluators

    in (groups, conns, params, messages)
    end

fun load_config_parse_str str = load_config_parse_messages (#4 (C.parseString str))


(* ------ ... ------ *)

fun testing _ = (load_config_parse "new_conf"; ())

fun testing n =
    let val _ = EV.start_session true (SOME default_alldefs)
	val _ = print ("[loaded library]")
    in eval_test n
    end

fun getParams params map_params =
    map (fn param =>
	    case List.find (fn (id : string, _) => id = param) map_params of
		SOME (id, v) => v
	      | NONE => raise Fail ("get_params(" ^ param ^ ")"))
	params

fun update_component (i, s) cmps =
    map (fn (j, p) =>
	    ((*print ("--" ^ NT.toStringTerm j ^ "\n");*)
	     if NT.alpha_equal_terms i j
	     then (i, s)
	     else (j, p)))
	cmps

fun print_message_list _ [] = ()
  | print_message_list n (msg :: msgs) =
    (print (Int.toString n ^ ": " ^ NT.nuprlTerm2eml msg ^ "\n--\n");
     print_message_list (n + 1) msgs)

fun print_messages_intransit () =
    (print ("\n-------IN-TRANSIT-------\n"); print_message_list 1 (!intransit))

fun debug_eval previous_result term n =
    let val _ = print ("-" ^ Int.toString n ^ "\n")
	val (p1,n1) = ev1 [] n term
	val (p2,n2) = ev2 [] n term
    in if n1 = n2 andalso NT.alpha_equal_terms p1 p2
       then if n1 = n
	    then debug_eval p1 term (n + 1)
	    else print ("equal[1:" ^ Int.toString n1 ^ ",2:" ^ Int.toString n2 ^ "]\n")
       else let val stout = TextIO.openOut "output-old"
		val _     = TextIO.output (stout, NT.toStringTerm previous_result ^ "\004\n")
		val _     = TextIO.closeOut stout
		val stout = TextIO.openOut "output-1"
		val _     = TextIO.output (stout, NT.toStringTerm p1 ^ "\004\n")
		val _     = TextIO.closeOut stout
		val stout = TextIO.openOut "output-2"
		val _     = TextIO.output (stout, NT.toStringTerm p2 ^ "\004\n")
		val _     = TextIO.closeOut stout
	    in print ("diff[1:" ^ Int.toString n1 ^ ",2:" ^ Int.toString n2 ^ "]\n")
	    end
    end

fun run_stepper n ev gc debug remove config alldefs extra =
    if n < 0
    then let val _ = configured := false
	     val _ = components := []
	     val _ = intransit  := []
	 in ()
	 end
    else if !loaded
    then if !configured
	 then case !intransit of
		  [] => print "[no message in transit]\n"
		| lst =>
		  if n > List.length lst orelse n < 1
		  then print "[out of bound]\n"
		  else if remove
		  then let val new_msgs = (List.take (lst, n - 1)) @ (List.drop (lst, n))
			   val _ = intransit := new_msgs
		       in ()
		       end
		  else let val (id, msg) = NT.dest_pair 3 (List.nth (lst, n - 1))
			   (*val _ = print ("-+-" ^ NT.toStringTerm id ^ "\n")*)
		       in case List.find (fn (i, p) =>
					     ((*print ("---" ^ NT.toStringTerm i ^ "\n");*)
					      NT.alpha_equal_terms i id))
					 (!components) of
			      SOME (i, p) =>
			      let (*val _ = print ("\n-+a+-----------\n" ^ NT.toStringTerm p  ^ "\n-+a+-----------\n")*)
				  (*val _  = print ("[size: " ^ IntInf.toString (NT.large_size p) ^ "]\n")*)
				  val _ = print ("[size(1): " ^ Int.toString (NT.size p) ^ "]\n")
				  val pop =
				      if is_newprog_extra extra
				      then if NT.is_nuprl_inl_term p
					   then SOME (NT.dest_inl p)
					   else if NT.is_nuprl_inr_term p
					   then NONE
					   else (dump_prog [] p NT.toStringTerm;
						 raise Fail ("run_stepper:newprog:not_inl_or_inr("
							     ^ NT.opid_of_term p
							     ^ ")"))
				      else SOME p
			      in case pop of
				     SOME p =>
				     let val toeval = nuprl_all (nuprl_app p msg)
					 val (p',stps) = ev [] (~1) toeval
					 val _ = if debug
						 then debug_eval toeval toeval 2025
						 else () (**)
					 (*val _ = raise Fail "--"*)
					 val (s,msgs) = NT.dest_pair 4 p'
					 val _  = print ("[size(2): " ^ IntInf.toString (NT.large_size s) ^ "]\n")
					 (*val _  = print ("[depth: " ^ Int.toString (NT.env_depth s) ^ "]\n")*)
					 (*val _  = print ("[env: " ^ Int.toString (NT.env_size s) ^ "]\n")*)
					 (*val _ = print ("\n-+b+-----------\n" ^ NT.toStringTerm p' ^ "\n-+b+-----------\n")*)
					 (*val _ = print ("\n-------MSGS------\n" ^ NT.toStringTerm msgs ^ "\n------------\n")*)
					 val lst_msgs = NT.dest_list msgs
					 val new_cmps = update_component (i, s) (!components)
					 val new_msgs = (List.take (lst, n - 1)) @ (List.drop (lst, n)) @ lst_msgs
					 val _ = components := new_cmps
					 val _ = intransit := new_msgs
				     in ()
				     end
				   | NONE => print "[program finished]\n"
			      end
			    | NONE => print "[no recipient]\n"
		       end
	 else let (* gets the locations and parameters from the input config file *)
		 val (groups, conns, params, messages) = load_config_parse config
		 (*val (locations, params, messages) = load_config config*)
